src/cf/DataProcessors/ПанельАдминистрированияБесшовнойИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияБесшовнойИнтеграции</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеИнтегрированныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИнтегрированныхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнтегрированнойСистемы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтегрированныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ПанельАдминистрированияБесшовнойИнтеграции/Forms/АвторизацияВИнтегрированнойСистеме/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИнтегрированнаяСистема", ИнтегрированнаяСистема);
	Параметры.Свойство("ПредставлениеИС", ПредставлениеИС);
	
	ДанныеАвторизации = РегистрыСведений.ДанныеИнтегрированныхСистем.ДанныеАвторизации(ИнтегрированнаяСистема, Ложь);
	Если ЗначениеЗаполнено(ДанныеАвторизации) Тогда
		ИмяПользователя = ДанныеАвторизации.ИмяПользователя;
		Пароль = ДанныеАвторизации.Пароль;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеИС) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = СтрШаблон(НСтр("ru = 'Доступ к %1'"), ПредставлениеИС);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнтегрированнаяСистема) Тогда
		АдресВебСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИнтегрированнаяСистема, "АдресВебСервиса");
	КонецЕсли;
	
#Если Не ВебКлиент Тогда
	// Добавим в список выбора имя пользователя ИС.
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Элементы.ИмяПользователя.СписокВыбора.Добавить(ПользовательИБ.Имя);
	Элементы.ИмяПользователя.КнопкаВыпадающегоСписка = Истина;
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПроверитьПодключениеИЗаписатьДанныеИСНаСервере();
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеИЗаписатьДанныеИСНаСервере()
	
	РаботаСИнтегрированнымиСистемами.ПолучитьПрокси(АдресВебСервиса, ИмяПользователя, Пароль);
	
	Попытка
		
		РегистрыСведений.ДанныеИнтегрированныхСистем.ЗаписатьДанные(ИнтегрированнаяСистема, ИмяПользователя, Пароль);
		
	Исключение
		ЗаписьЖурналаРегистрации(
			РаботаСИнтегрированнымиСистемами.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
